package com.example.seminar_manage_showroom_app.adapter;

import java.util.HashMap;

public class MisreadingPreventionSettingsTable {

    /**  読取識別番号テーブル添え字（読取識別番号） */
    public static final int INDEX_ID = 0;
    /**  読取識別番号テーブル添え字（PP1） */
    public static final int INDEX_PP1 = 1;
    /**  読取識別番号テーブル添え字（PCWD70） */
    public static final int INDEX_PCWD70 = 2;

    /** レジスタ格納連想配列参照用キー（PP1） */
    public static final String KEY_PP1 = "PP1";
    /** レジスタ格納連想配列参照用キー（PCWD70） */
    public static final String KEY_PCWD70 = "PCWD70";

    /**
     * 読取識別番号テーブルを取得する
     *
     * @return 読取識別番号テーブル
     */
    public static int[][] getMisreadingPreventionSettingsTable() {
        int[][] table = {
                //id,    PP1   ,PCWD7-0
                {  0,0x00000000,0x00},
                {  1,0x00020400,0x01},
                {  2,0x00020400,0x02},
                {  3,0x00020400,0x03},
                {  4,0x00020400,0x05},
                {  5,0x00020400,0x06},
                {  6,0x00020400,0x07},
                {  7,0x00020400,0x08},
                {  8,0x00020400,0x09},
                {  9,0x00020400,0x0A},
                { 10,0x00020400,0x0B},
                { 11,0x00020400,0x0D},
                { 12,0x00020400,0x0E},
                { 13,0x00010200,0x01},
                { 14,0x00010200,0x05},
                { 15,0x00010200,0x06},
                { 16,0x00010200,0x07},
                { 17,0x00010200,0x08},
                { 18,0x00010200,0x09},
                { 19,0x00010200,0x0D},
                { 20,0x00010200,0x0E},
                { 21,0x00010300,0x01},
                { 22,0x00010300,0x02},
                { 23,0x00010300,0x03},
                { 24,0x00010300,0x05},
                { 25,0x00010300,0x06},
                { 26,0x00010300,0x07},
                { 27,0x00010300,0x08},
                { 28,0x00010300,0x09},
                { 29,0x00010300,0x0A},
                { 30,0x00010300,0x0B},
                { 31,0x00010300,0x0D},
                { 32,0x00010300,0x0E},
                { 33,0x00020200,0x05},
                { 34,0x00020200,0x06},
                { 35,0x00020200,0x07},
                { 36,0x00020200,0x0D},
                { 37,0x00020200,0x0E},
                { 38,0x00020300,0x05},
                { 39,0x00020300,0x06},
                { 40,0x00020300,0x07},
                { 41,0x00020300,0x0D},
                { 42,0x00020300,0x0E},
                { 43,0x00030200,0x05},
                { 44,0x00030200,0x06},
                { 45,0x00030200,0x0D},
                { 46,0x00030200,0x0E},
                { 47,0x00020000,0x01},
                { 48,0x00020000,0x02},
                { 49,0x00020000,0x03},
                { 50,0x00020000,0x04},
                { 51,0x00020000,0x05},
                { 52,0x00020000,0x06},
                { 53,0x00020000,0x07},
                { 54,0x00020000,0x08},
                { 55,0x00020000,0x09},
                { 56,0x00020000,0x0A},
                { 57,0x00020000,0x0B},
                { 58,0x00020000,0x0C},
                { 59,0x00020000,0x0D},
                { 60,0x00020000,0x0E},
                { 61,0x00030300,0x05},
                { 62,0x00030300,0x06},
                { 63,0x00030300,0x0D},
                { 64,0x00030300,0x0E},
                { 65,0x00020400,0x0F},
                { 66,0x00020400,0x10},
                { 67,0x00020400,0x11},
                { 68,0x00020400,0x12},
                { 69,0x00020400,0x13},
                { 70,0x00020400,0x15},
                { 71,0x00020400,0x16},
                { 72,0x00020400,0x17},
                { 73,0x00020400,0x18},
                { 74,0x00020400,0x19},
                { 75,0x00020400,0x1A},
                { 76,0x00020400,0x1B},
                { 77,0x00020400,0x1D},
                { 78,0x00020400,0x1E},
                { 79,0x00020400,0x1F},
                { 80,0x00010200,0x0F},
                { 81,0x00010200,0x10},
                { 82,0x00010200,0x11},
                { 83,0x00010200,0x15},
                { 84,0x00010200,0x16},
                { 85,0x00010200,0x17},
                { 86,0x00010200,0x18},
                { 87,0x00010200,0x19},
                { 88,0x00010200,0x1A},
                { 89,0x00010200,0x1D},
                { 90,0x00010200,0x1E},
                { 91,0x00010200,0x1F},
                { 92,0x00010300,0x0F},
                { 93,0x00010300,0x10},
                { 94,0x00010300,0x11},
                { 95,0x00010300,0x12},
                { 96,0x00010300,0x13},
                { 97,0x00010300,0x15},
                { 98,0x00010300,0x16},
                { 99,0x00010300,0x17},
                {100,0x00010300,0x18},
                {101,0x00010300,0x19},
                {102,0x00010300,0x1A},
                {103,0x00010300,0x1B},
                {104,0x00010300,0x1D},
                {105,0x00010300,0x1E},
                {106,0x00010300,0x1F},
                {107,0x00020200,0x0F},
                {108,0x00020200,0x15},
                {109,0x00020200,0x16},
                {110,0x00020200,0x17},
                {111,0x00020200,0x1D},
                {112,0x00020200,0x1E},
                {113,0x00020200,0x1F},
                {114,0x00020300,0x15},
                {115,0x00020300,0x16},
                {116,0x00020300,0x1D},
                {117,0x00020300,0x1E},
                {118,0x00030200,0x15},
                {119,0x00030200,0x16},
                {120,0x00030200,0x1D},
                {121,0x00030200,0x1E},
                {122,0x00020000,0x0F},
                {123,0x00020000,0x10},
                {124,0x00020000,0x11},
                {125,0x00020000,0x12},
                {126,0x00020000,0x13},
                {127,0x00020000,0x14},
                {128,0x00020000,0x15},
                {129,0x00020000,0x16},
                {130,0x00020000,0x17},
                {131,0x00020000,0x18},
                {132,0x00020000,0x19},
                {133,0x00020000,0x1A},
                {134,0x00020000,0x1B},
                {135,0x00020000,0x1C},
                {136,0x00020000,0x1D},
                {137,0x00020000,0x1E},
                {138,0x00020000,0x1F},
                {139,0x00030300,0x15},
                {140,0x00030300,0x16},
                {141,0x00030300,0x1D},
                {142,0x00030300,0x1E}};
        return table;
    }

    /**
     * 読取識別番号テーブルより、指定した読み取り識別番号に対応するレジスタ格納連想配列を取得
     *
     * @param id 読取識別番号
     * @return ≠nullの場合、レジスタ格納連想配列
     */
    public static HashMap<String, Integer> getMisreadingPreventionSettingsTableValue(int id) {
        HashMap<String, Integer> dic = null;
        //読取識別番号テーブル取得
        int[][] table = getMisreadingPreventionSettingsTable();
        //検索
        for(int i = 0; i < table.length; i++){
            if(table[i][INDEX_ID] == id){
                //見つかったのでレジスタ格納連想配列作成
                dic = new HashMap<>();
                dic.put(KEY_PP1, table[i][INDEX_PP1]);
                dic.put(KEY_PCWD70, table[i][INDEX_PCWD70]);
                break;
            }
        }
        return dic;
    }

    /**
     * 読取識別番号テーブルより、指定したPP1,PCWD7-0に対応する読取識別番号を取得
     *
     * @param pp1 pp1レジスタ
     * @param pcwD70 pcwD7-0レジスタ
     * @return 0以上の場合、読取識別番号
     */
    public static int getIdFromMisreadingPreventionSettingsTable(int pp1, int pcwD70) {
        int id = -1;
        //読取識別番号テーブル取得
        int[][] table = getMisreadingPreventionSettingsTable();
        //検索
        for(int i = 0; i < table.length; i++){
            if((table[i][INDEX_PP1] == pp1) && (table[i][INDEX_PCWD70] == pcwD70)){
                //見つかったので読取識別番号セット
                id = table[i][INDEX_ID];
                break;
            }
        }
        return id;
    }
}
